cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pmeinhardt/tools'
tap 'puma/puma'

brew 'ack'
brew 'ag'
brew 'bat'
brew 'coreutils'
brew 'fd'
brew 'fpp'
brew 'fzf'
brew 'git'
brew 'go'
brew 'grc'
brew 'hadolint'
brew 'imagemagick'
brew 'jp2a'
brew 'kubectx'
brew 'libcaca'
brew 'libgit2'
brew 'lynx'
brew 'neovim'
brew 'ngrep'
brew 'node'
brew 'openssl'
brew 'pmeinhardt/tools/hmm', args: ['HEAD']
brew 'pmeinhardt/tools/tm', args: ['HEAD']
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'roundup'
brew 'ruby-build'
brew 'rust'
brew 's-search'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'tig'
brew 'tmux'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'docker'
cask 'epoch-flip-clock'
cask 'firefox'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'handbrake'
cask 'hex-fiend'
cask 'imageoptim'
cask 'kap'
cask 'ngrok'
cask 'postgres'
cask 'slack'
cask 'spectacle'
cask 'steam'
cask 'teamviewer'
cask 'tunnelbear'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
