cask_args appdir: '/Applications'

tap 'get-woke/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pmeinhardt/tools'

brew 'ansible'
brew 'ansible-lint'
brew 'bat'
brew 'bottom'
brew 'coreutils'
brew 'curl'
brew 'dasel'
brew 'dotenv-linter'
brew 'fd'
brew 'fpp'
brew 'fzf'
brew 'get-woke/tap/woke'
brew 'gh'
brew 'git'
brew 'glab'
brew 'go'
brew 'grc'
brew 'hadolint'
brew 'hyperfine'
brew 'imagemagick'
brew 'krew'
brew 'lynx'
brew 'neovim'
brew 'ngrep'
brew 'node'
brew 'openssl'
brew 'pmeinhardt/tools/bun'
brew 'pmeinhardt/tools/bup'
brew 'pmeinhardt/tools/hmm'
brew 'pmeinhardt/tools/tm'
brew 'poetry'
brew 'postgresql'
brew 'pyenv'
brew 'qrencode'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'rust'
brew 's-search'
brew 'sd'
brew 'shellcheck'
brew 'spark'
brew 'tig'
brew 'tmux'
brew 'vim'
brew 'watchexec'
brew 'watchman'
brew 'wget'
brew 'yamllint'
brew 'yarn'
brew 'youtube-dl'

cask 'deckset'
cask 'docker'
cask 'epoch-flip-clock'
cask 'firefox'
cask 'font-inter'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'hex-fiend'
cask 'imageoptim'
cask 'kap'
cask 'postgres-unofficial'
cask 'rectangle'
cask 'slack'
cask 'steam'
cask 'visual-studio-code'
