cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'pmeinhardt/tools'

brew 'ansible'
brew 'ansible-lint'
brew 'bat'
brew 'bottom'
brew 'coreutils'
brew 'curl'
brew 'dotenv-linter'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'glab'
brew 'go'
brew 'grc'
brew 'hadolint'
brew 'hyperfine'
brew 'neovim'
brew 'ngrep'
brew 'node'
brew 'openssl'
brew 'pmeinhardt/tools/bun'
brew 'pmeinhardt/tools/bup'
brew 'pmeinhardt/tools/hmm'
brew 'pmeinhardt/tools/ign'
brew 'pmeinhardt/tools/tm'
brew 'poetry'
brew 'pyenv'
brew 'qrencode'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'
brew 'ruby-build'
brew 'rustup'
brew 'sd'
brew 'shellcheck'
brew 'slides'
brew 'spark'
brew 'tig'
brew 'tmux'
brew 'watchexec'
brew 'wget'
brew 'yamllint'

cask 'deckset'
cask 'firefox'
cask 'font-inter'
cask 'font-source-code-pro'
cask 'rectangle'
cask 'steam'
cask 'visual-studio-code'
